export const GRANTS: string[] = ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"];

export const GRANT_CATEGORIES_1: string[][] = [
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金"],
    ["IT導入補助金", "事業再構築補助金"],
    ["IT導入補助金", "事業再構築補助金"],
    ["IT導入補助金", "事業再構築補助金"],
    ["IT導入補助金", "事業再構築補助金"]
]

export const GRANT_CATEGORIES_2: string[][] = [
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金", "小規模事業者補助金"],
    ["IT導入補助金", "事業再構築補助金"],
    ["事業再構築補助金"],
    ["事業再構築補助金"],
    ["事業再構築補助金"]
]

type GrantCategories = {
    [category: string]: {
        [subCategory: string]: string[];
    };
};

export const GRANT_CATEGORIES_4: GrantCategories = {
    "1": {
        "1": ["IT導入補助金_デジタル化基盤導入枠_デジタル化基盤導入類型", "小規模事業者補助金_小規模事業者持続化補助金"],
        "2": ["小規模事業者補助金_小規模事業者持続化補助金"],
    },
    "2": {
        "1": ["IT導入補助金_デジタル化基盤導入枠_デジタル化基盤導入類型"],
        "2": ["IT導入補助金_デジタル化基盤導入枠_商流一括インボイス対応類型"],
        "3": ["IT導入補助金_デジタル化基盤導入枠_デジタル化基盤導入類型"],
    },
    "3": {
        "1": ["事業再構築補助金_成長枠"],
        "2": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"],
        "3": ["事業再構築補助金_成長枠"],
        "4": ["小規模事業者補助金_小規模事業者持続化補助金","事業再構築補助金_成長枠"],
    },
    "4": {
        "1": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"],
        "2": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"],
        "3": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"],
        "4": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"],            
    },
    "5": {
        "1": ["小規模事業者補助金_小規模事業者持続化補助金"],
        "2": ["IT導入補助金_デジタル化基盤導入枠_デジタル化基盤導入類型"],
        "3": ["事業再構築補助金_産業構造転換枠"],
        "4": ["事業再構築補助金_成長枠", "小規模事業者補助金_小規模事業者持続化補助金"], 
        "5": ["事業再構築補助金_成長枠"]           
    },
}